https://towardsdatascience.com/pandas-python-tricks-for-data-science-data-analysis-part-3-462d0e952925

Mask Function

In [2]:
import pandas as pd
import numpy as np

df=pd.DataFrame({'A':[4,7,-6,2,-9],
                 'B':[12,-7,7,-6,23],
                 'C':[54,-21,34,32,-12]})

print(df)
df.mask(df<0,np.NaN)

   A   B   C
0  4  12  54
1  7  -7 -21
2 -6   7  34
3  2  -6  32
4 -9  23 -12

     A     B     C
0  4.0  12.0  54.0
1  7.0   NaN   NaN
2  NaN   7.0  34.0
3  2.0   NaN  32.0
4  NaN  23.0   NaN

Style object

In [3]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'A':[4,7,-6],
                   'B':[12,-7,7],
                   'C':[54,-21,-34]})

def color_negative_to_red(val):
    color='red' if val<0 else 'green'
    return 'color: %s' % color

df.style.applymap(color_negative_to_red)

print to markdown

Display as Markdown

In [4]:
import pandas as pd
candidates_df = pd.DataFrame({'Name':['Aida', 'Mamadou','Aich'],
                              'Degree':['Master','Master','PhD'],
                              'From':['Abidjan','Dakar','Abidjan'],
                              'Years_exp':[2,3,5],
                              'From_office(min)':[120,95,80]})
print(candidates_df.to_markdown(tablefmt='grid'))

+----+---------+----------+---------+-------------+--------------------+
|    | Name    | Degree   | From    |   Years_exp |   From_office(min) |
+====+=========+==========+=========+=============+====================+
|  0 | Aida    | Master   | Abidjan |           2 |                120 |
+----+---------+----------+---------+-------------+--------------------+
|  1 | Mamadou | Master   | Dakar   |           3 |                 95 |
+----+---------+----------+---------+-------------+--------------------+
|  2 | Aich    | PhD      | Abidjan |           5 |                 80 |
+----+---------+----------+---------+-------------+--------------------+

SQL-Like Queries

In [7]:
import pandas as pd
candidates_df = pd.DataFrame({'Name':['Aida', 'Mamadou','Aich','Fatou','Khalil'],
                              'Degree':['Master','Master','PhD','Master','PhD'],
                              'From':['Abidjan','Dakar','Abidjan','Konakry','Lonrne'],
                              'Years_exp':[2,3,5,4,3],
                              'From_office(min)':[120,95,80,100,34]})
candidates_df.query("Degree == 'Master' and Years_exp > 2")

      Name  Degree     From  Years_exp  From_office(min)
1  Mamadou  Master    Dakar          3                95
3    Fatou  Master  Konakry          4               100

Scikit Learn Exercise

In [16]:
import pandas as pd
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import train_test_split
X = pd.DataFrame({'x1':[0.1,0.5,0.9,1.3,1.7,2.1,2.5],
                  'x2':[0.2,0.6,1.0,1.4,1.8,2.2,2.6],
                  'x3':[0.3,0.7,1.1, 1.5, 1.9,2.3,2.7],
                  'x4':[0.4,0.8,1.2,1.6,2.0,2.4,2.8]})
y = pd.DataFrame({'y':[0,1,0,1,0,1,0]})
display(X)
display(y)
X_train, X_test, y_train, y_test = train_test_split(X,y)

scaler=StandardScaler()
scaler.fit(X_train)
X_test_scaled=scaler.transform(X_test)
scaler = StandardScaler().set_output(transform="pandas")
scaler.fit(X_train)
X_test_scaled = scaler.transform(X_test)
print(X_test_scaled)
display(X_test_scaled)

    x1   x2   x3   x4
0  0.1  0.2  0.3  0.4
1  0.5  0.6  0.7  0.8
2  0.9  1.0  1.1  1.2
3  1.3  1.4  1.5  1.6
4  1.7  1.8  1.9  2.0
5  2.1  2.2  2.3  2.4
6  2.5  2.6  2.7  2.8

   y
0  0
1  1
2  0
3  1
4  0
5  1
6  0

         x1        x2        x3        x4
1 -1.030244 -1.030244 -1.030244 -1.030244
4  0.374634  0.374634  0.374634  0.374634

         x1        x2        x3        x4
1 -1.030244 -1.030244 -1.030244 -1.030244
4  0.374634  0.374634  0.374634  0.374634

Use of to_period function

In [31]:

import pandas as pd
import datetime as dt
from dateutil import parser

df = pd.DataFrame({'Name':['Aida', 'Mamadou','Ismael','Aicha','Fatou','Khalil'],
                              'Degree':['Master','Master','Bachelor','PhD','Master','PhD'],
                              'Application_date':['2022-11-17','2022-09-02','2022-12-02', \
                                                  '2022-08-25','2022-01-07','2022-12-26']})

df['Application_date']=df['Application_date'].apply(parser.parse)
df['month']=df['Application_date'].dt.to_period("M")

df['quarter']=df['Application_date'].dt.to_period("Q")
print(df)

      Name    Degree Application_date    month quarter
0     Aida    Master       2022-11-17  2022-11  2022Q4
1  Mamadou    Master       2022-09-02  2022-09  2022Q3
2   Ismael  Bachelor       2022-12-02  2022-12  2022Q4
3    Aicha       PhD       2022-08-25  2022-08  2022Q3
4    Fatou    Master       2022-01-07  2022-01  2022Q1
5   Khalil       PhD       2022-12-26  2022-12  2022Q4

Use of Counter object

In [32]:
from collections import Counter
cities =['Abidjan','Dakar','Dakar','Bamako','Douala','Bamako','Abidjan','Abidjan']

print(Counter(cities))

Counter({'Abidjan': 3, 'Dakar': 2, 'Bamako': 2, 'Douala': 1})

Combine items

In [33]:
names=["Nabintou","Saliou","Ibrahim"]
cities=['Abidjan','Dakar','Bamako']
years_exp=[3,2,4]
candidates=zip(names, cities,years_exp)

print(list(candidates))

[('Nabintou', 'Abidjan', 3), ('Saliou', 'Dakar', 2), ('Ibrahim', 'Bamako', 4)]

Multiple Lists from Aggregated Items

In [36]:
candidates=[("Nabintou",'Abidjan', 3),
            ("Saliou","Dakar", 2),
            ("Ibrahim",'Bamako',4)]
names, cities, years_exp=zip(*candidates)
print(list(names))
print(list(cities))
print(list(years_exp))

['Nabintou', 'Saliou', 'Ibrahim']
['Abidjan', 'Dakar', 'Bamako']
[3, 2, 4]

List Comprehension

In [40]:
original_list=[2,32,3,6,4,76,5,9,11]
evens_list=[even for even in original_list if even%2==0]
print(evens_list)

evens_list=[]
for value in original_list:
    if(value%2==0):
        evens_list.append(value)
        
print(evens_list)

[2, 32, 6, 4, 76]
[2, 32, 6, 4, 76]

Dictionary Comprehension

In [44]:
original_list=[2,32,3,6,4,76,5,9,11]
evens_list={i:num for i,num in enumerate(original_list) if num %2==0}
print(evens_list)

evens_dict={}
for i in range(len(original_list)):
    if(original_list[i]%2==0):
        evens_dict[i]=original_list[i]
        
print(evens_list)

{0: 2, 1: 32, 3: 6, 4: 4, 5: 76}
{0: 2, 1: 32, 3: 6, 4: 4, 5: 76}